Catalogs/ИА_ВопросыПроверочногоСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВопросыПроверочногоСписка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_ПроверочныйСписок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантныйОтвет</Name>
					<Comment>Простой/Вариантный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Балл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_ВопросыПроверочногоСписка/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	//-> Григорьева
	//очистка ненужных данных
	Если ВариантныйОтвет Тогда
		БаллВопроса = 0;
		ОтветВопроса = 0;
	Иначе
		ВариантыОтветов.Очистить();
	КонецЕсли; 
	//<- Григорьева
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//-> Григорьева
	Если ВариантныйОтвет Тогда
		ПроверяемыеРеквизиты.Добавить("ВариантыОтветов");
		
		//проверим на дубли ответов
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВариантыОтветов.НомерСтроки,
		               |	ВариантыОтветов.Ответ
		               |ПОМЕСТИТЬ ДанныеТабличнойЧасти
		               |ИЗ
		               |	&ВариантыОтветов КАК ВариантыОтветов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеТабличнойЧасти.НомерСтроки) КАК НомерСтроки,
		               |	ДанныеТабличнойЧасти.Ответ
		               |ИЗ
		               |	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДанныеТабличнойЧасти.Ответ
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеТабличнойЧасти.НомерСтроки) > 1";
					   
		Запрос.УстановитьПараметр("ВариантыОтветов", ВариантыОтветов.Выгрузить());
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ИА_КСУОбщийКлиентСервер.СообщитьПользователю("Дублируется ответ: " + Выборка.Ответ,,,, Отказ);
		КонецЦикла; 
	Иначе
		ПроверяемыеРеквизиты.Добавить("ОтветВопроса");
	КонецЕсли;
	//<- Григорьева
	
КонецПроцедуры
